<template>
  <march14-preview/>
  <transition name="fade">
    <v-popup :currentPopup="currentPopup" v-model:show="popupVisible">
    </v-popup>
  </transition>
  <div class="row">
    <div v-for="column in row" class="column">
      <div v-for="item in column" :class="['item', {'item-active' : showActiveClass(item)}]">
        <div class="item__current">{{ item.current }}</div>
        <div class="item__time">{{ item.time }}</div>
        <div class="item__support">{{ item.support }}</div>
        <div class="item__title">{{ item.title }}</div>
        <div class="item__speaker">{{ item.speaker }}</div>
        <button @click="showPopup(item)" class="item__more-info">Подробнее</button>
      </div>
    </div>
  </div>
</template>

<script>
import March14Preview from "@/components/March14Preview";
import VPopup from "@/components/UI/VPopup";

export default {
  data() {
    return {
      popupVisible: false,
      currentPopup: {},
      row: [
        [
          {
            current: "Сейчас",
            time: "12:15–13:45",
            timeStart: {
              year: 2023,
              month: 2,
              date: 14,
              hours: 12,
              minute: 15,
            },
            timeEnd: {
              year: 2023,
              month: 2,
              date: 14,
              hours: 13,
              minute: 45,
            },
            support: "Сателлитный симпозиум\n" +
                "при поддержке компании Лореаль\n" +
                "* Не обеспечивается баллами НМО",
            title: "Возможности современной\n" +
                "дерматокосметики \n",
            speaker: "Председатель: Львов А.Н.",
            textHtml: "<div class='popup__top'> " +
                "<p class='item__time item__time-popup'>12:15–13:45</p>" +
                "<p class='text-gray'>* Не обеспечивается баллами НМО</p>" +
                "</div>" +
                "<p class='support'>Сателлитный симпозиум при поддержке компании Лореаль</p>" +
                "<p class='theme-main'>Возможности современной дерматокосметики</p>" +
                "<p class='speaker'>Председатель: <span>Львов А.Н.</span>, руководитель отдела аспирантуры и ординатуры, профессор кафедры дерматовенерологии и косметологии «Центральная государственная медицинская академия» Управления делами Президента Российской Федерации; главный научный сотрудник Медицинского научно-образовательного центра МГУ им. М.В. Ломоносова, д.м.н., профессор.</p>" +
                "<p class='theme'>Современные представления о влиянии микробиома и внешних факторов на течение акне</p>" +
                "<p class='speaker'>Хлебникова А.Н., профессор кафедры дерматовенерологии и дерматоонкологии ФУВ ГБУЗ МО «Московский областной научноисследовательский клинический институт им. М.Ф. Владимирского», д.м.н., профессор.  (30 мин.)</p>" +
                "<p class='theme'>Экзогенные и эндогенные механизмы ксероза кожи и пути рациональной коррекции</p>" +
                "<p class='speaker'>Львов А.Н. (30 мин.)</p>" +
                "<p class='theme'>Роль эмолентов в профилактике сезонных обострений атопического дерматита, связанного с аллергией на пыльцу растений</p>" +
                "<p class='speaker'>Феденко Е.С., заведующая отделением аллергологии и иммунопатологии кожи № 4, ФГБУ «ГНЦ Институт иммунологии» ФМБА России, д.м.н., профессор (30 мин.)</p>"
            ,
            id: 11,
          },
          {
            current: "Сейчас",
            time: "14:00–15:15",
            timeStart: {
              year: 2023,
              month: 2,
              date: 14,
              hours: 14,
              minute: 0,
            },
            timeEnd: {
              year: 2023,
              month: 2,
              date: 14,
              hours: 15,
              minute: 15,
            },
            support: "",
            title: "Современные аспекты\n" +
                "диагностики и терапии\n" +
                "распространенных дерматозов.\n" +
                "Часть 1.",
            speaker: "Председатель: Тамразова О.Б.",
            textHtml: "<div class='popup__top'> " +
                "<p class='item__time item__time-popup'>14:00–15:15</p>" +
                "<p class='text-gray'></p>" +
                "</div>" +
                "<p class='support'></p>" +
                "<p class='theme-main'>Современные аспекты диагностики и терапии распространенных дерматозов. Часть 1.</p>" +
                "<p class='speaker'>Председатель: <span>Тамразова О.Б.</span></p>" +
                "<p class='theme'>Стероидосберегающая терапия хронических дерматозов</p>"+
                "<p class='speaker'>Тамразова О.Б. (15 мин.)</p>" +
                "<p class='speaker'>* При поддержке компании ИНВАР. Не обеспечивается баллами НМО.</p>"+
                "<p class='theme'>Ассоциация витилиго с аутоиммунной надпочечниковой недостаточностью</p>"+
                "<p class='speaker'>Петров В.А., Жукова О.В., Волнухин В.А., Трошина Е.А., Юкина М.Ю., Орлова Е.М., Нуралиева Н.Ф. (15 мин.)</p>" +
                "<p class='theme'>Сложности дифференциальной терапии псориаза и себорейного дерматита. Принципы динамической терапии.</p>"+
                "<p class='speaker'>Тамразова О.Б. (30 мин.)</p>" +
                "<p class='theme'>Дискуссия (15 мин.)</p>"
            ,
            id: 12,
          },
          {
            current: "Сейчас",
            time: "15:30–17:00",
            timeStart: {
              year: 2023,
              month: 2,
              date: 14,
              hours: 15,
              minute: 30,
            },
            timeEnd: {
              year: 2023,
              month: 2,
              date: 14,
              hours: 17,
              minute: 0,
            },
            support: "Сателлитный симпозиум\n" +
                "при поддержке компании Биокад\n" +
                "* Не обеспечивается баллами НМО ",
            title: "Псориаз и псориатический\n" +
                "артрит. Выбор в пользу\n" +
                "пациента.",
            speaker: "Председатель: Разнатовский К. И.\n" +
                "Сопредседатель: Коротаева Т. В.",
            textHtml: "<div class='popup__top'> " +
                "<p class='item__time item__time-popup'>15:30–17:00</p>" +
                "<p class='text-gray'>* Не обеспечивается баллами НМО </p>" +
                "</div>" +
                "<p class='support'>Сателлитный симпозиум при поддержке компании Биокад</p>" +
                "<p class='theme-main'>Псориаз и псориатический артрит. Выбор в пользу пациента. </p>" +
                "<p class='speaker'>Председатель: <span>Разнатовский К. И.</span>, главный внештатный специалист по дерматовенерологии и косметологии Комитета здравоохранения Санкт-Петербурга и Северо-Западного Федерального округа, заведующий кафедрой дерматовенерологии ФГБУ ВО «Северо-Западного государственного медицинского университета им. И.И. Мечникова», д.м.н., профессор. </p>" +
                "<p class='speaker'>Сопредседатель: <span>Коротаева Т. В.</span>, заведующая лабораторией диагностики и инновационных методов лечения псориатического артрита ФГБНУ «НИИР им. В.А. Насоновой» Минздрава России, врач-ревматолог высшей квалификационной категории, д.м.н., профессор.</p>" +
                "<p class='theme'>Терапия псориаза – единый вектор для врача и пациента</p>" +
                "<p class='speaker'>Свечникова Е. В., заведующая отделением дерматовенерологии и косметологии ФГБУ «Поликлиника № 1» Управления делами Президента РФ, д.м.н. (25 мин.)</p>"+
                "<p class='theme'>Терапия ГИБП в сложных клинических ситуациях</p>"+
                "<p class='speaker'>Курдина М.И., врач-дерматовенеролог высшей квалификационной категории, клинико-диагностический центр МЕДСИ (Москва), д.м.н., профессор (25 мин.)</p>"+
                "<p class='theme'>Ранняя диагностика и терапия псориатического артрита у пациентов с псориазом</p>"+
                "<p class='speaker'>Коротаева Т.В. (25 мин.)</p>"+
                "<p class='theme'>Дискуссия (15 мин.)</p>"
            ,
            id: 13,
          },
          {
            current: "Сейчас",
            time: "17:30-19:00",
            timeStart: {
              year: 2023,
              month: 2,
              date: 14,
              hours: 17,
              minute: 30,
            },
            timeEnd: {
              year: 2023,
              month: 2,
              date: 14,
              hours: 19,
              minute: 0,
            },
            support: "",
            title: "Артдерма\n" +
                "Художественно-дерматовенерологическая\n" +
                "викторина",
            speaker: "Ведущие: Никас Сафронов,\n" +
                "Николай Потекаев",
            textHtml: "<div class='popup__top'> " +
                "<p class='item__time item__time-popup'>17:30-19:00</p>" +
                "<p class='text-gray'></p>" +
                "</div>" +
                "<p class='support'></p>" +
                "<p class='theme-main'>АРТДЕРМА. Художественно-дерматовенерологическая викторина</p>" +
                "<p class='speaker'>Ведущие: <span>Никас Сафронов</span>, <span>Николай Потекаев</span></p>"
            ,
            id: 14,
          },
        ],
        [
          {
            current: "Сейчас",
            time: "12:15–13:15",
            timeStart: {
              year: 2023,
              month: 2,
              date: 14,
              hours: 12,
              minute: 15,
            },
            timeEnd: {
              year: 2023,
              month: 2,
              date: 14,
              hours: 13,
              minute: 15,
            },
            support: "",
            title: "Актуальные вопросы аппаратной\n" +
                "косметологии",
            speaker: "Председатель: Петунина В. В.",
            textHtml: "<div class='popup__top'> " +
                "<p class='item__time item__time-popup'>12:15–13:15</p>" +
                "<p class='text-gray'></p>" +
                "</div>" +
                "<p class='support'></p>" +
                "<p class='theme-main'>Актуальные вопросы аппаратной косметологии</p>" +
                "<p class='speaker'>Председатель: <span>Петунина Валентина Вадимовна</span>, доцент кафедры кожных болезней и косметологии Факультета дополнительного профессионального образования ФГАОУ ВО «Российский национальный исследовательский медицинский университет имени Н.И. Пирогова» Министерства здравоохранения РФ, кандидат медицинских наук.</p>" +
                "<p class='theme'>Визуализация патоморфологических изменений, происходящих в результате лазерного воздействия на кожу</p>" +
                "<p class='speaker'>Карпенко А.А., Петрова К.С., Петрова Г.А., Щенникова Н.К. (15 мин.)</p>"+
                "<p class='theme'>Клинический опыт применения фотодинамической терапии в лечении акне</p>" +
                "<p class='speaker'>Раджабова М.М. (15 мин.)</p>"+
                "<p class='theme'>Детекция и дифференциация филлеров методом высокочастотной ультразвуковой визуализации</p>" +
                "<p class='speaker'>Безуглый А.П., Белков П.А., Безуглый Н.А. (15 мин.)</p>"+
                "<p class='theme'>Дискуссия (15 мин.)</p>"
            ,
            id: 21,
          },
          {
            current: "Сейчас",
            time: "13:30–15:00",
            timeStart: {
              year: 2023,
              month: 2,
              date: 14,
              hours: 13,
              minute: 30,
            },
            timeEnd: {
              year: 2023,
              month: 2,
              date: 14,
              hours: 15,
              minute: 0,
            },
            support: "Сателлитный симпозиум Nature's\n" +
                "Bounty\n" +
                "* Не обеспечивается баллами НМО",
            title: "Современные аспекты\n" +
                "профилактики возрастассоциированных изменений\n" +
                "кожи. Роль и место\n" +
                "нутрицевтической поддержки.",
            speaker: "Председатель: Хрянин А.А.\n" +
                "Сопредседатели: Чернова Н.И.,\n" +
                "Духанин А.С.",
            textHtml: "<div class='popup__top'> " +
                "<p class='item__time item__time-popup'>13:30–15:00</p>" +
                "<p class='text-gray'>* Не обеспечивается баллами НМО</p>" +
                "</div>" +
                "<p class='support'>Сателлитный симпозиум Nature's Bounty</p>" +
                "<p class='theme-main'>Современные аспекты профилактики возраст-ассоциированных изменений кожи. Роль и место нутрицевтической поддержки.</p>" +
                "<p class='speaker'>Председатель: <span>Хрянин А.А.</span>, профессор кафедры дерматовенерологии и косметологии Новосибирского государственного медицинского университета МЗ РФ, президент РОО «Ассоциация акушеров-гинекологов и дерматовенерологов», д.м.н." +
                "<p class='speaker'>Сопредседатели: <span>Чернова Н.И.</span>, <span>Духанин А.С.</span></p>" +
                "<p class='theme'>Сигнальные признаки метаболических нарушений на коже. Возможности сохранения красоты и профилактики заболеваний в свете современных фундаментальных исследований. Разбор клинических случаев.</p>" +
                "<p class='speaker'>Чернова Н.И.(25 мин.)</p>"+
                "<p class='theme'>Управление возрастными изменениями. Влияние микро- и микронутриентов.</p>" +
                "<p class='speaker'>Хрянин А.А.(25 мин.)</p>"+
                "<p class='theme'>Антивозрастная нутрициология с позиции клинического фармаколога</p>" +
                "<p class='speaker'>Духанин А.С. (25 мин.)</p>" +
                "<p class='theme'>Дискуссия (15 мин.)</p>"
            ,
            id: 22,
          },
          {
            current: "Сейчас",
            time: "15:15–18:30",
            timeStart: {
              year: 2023,
              month: 2,
              date: 14,
              hours: 15,
              minute: 15,
            },
            timeEnd: {
              year: 2023,
              month: 2,
              date: 14,
              hours: 18,
              minute: 30,
            },
            support: "",
            title: "Анатомический Кадавер курс",
            speaker: "Модератор: Сайбель А.В.\n" +
                "Анатом: Овчаренко Т.А.",
            textHtml: "<div class='popup__top'> " +
                "<p class='item__time item__time-popup'>15:15–18:30</p>" +
                "<p class='text-gray'></p>" +
                "</div>" +
                "<p class='support'></p>" +
                "<p class='theme-main'>Анатомический Кадавер курс</p>" +
                "<p class='speaker'>Модератор: Сайбель Анастасия Валерьевна</p>" +
                "<p class='speaker'>Анатом: Овчаренко Татьяна Андреевна</p>"
            ,
            id: 23,
          },
        ],
        [
          {
            current: "Сейчас",
            time: "12:15–13:50",
            timeStart: {
              year: 2023,
              month: 2,
              date: 14,
              hours: 12,
              minute: 15,
            },
            timeEnd: {
              year: 2023,
              month: 2,
              date: 14,
              hours: 13,
              minute: 50,
            },
            support: "",
            title: "Вопросы фундаментальной\n" +
                "дерматовенерологии",
            speaker: "Председатель: Доля О.В.",
            textHtml: "<div class='popup__top'> " +
                "<p class='item__time item__time-popup'>12:15–13:50</p>" +
                "<p class='text-gray'></p>" +
                "</div>" +
                "<p class='support'></p>" +
                "<p class='theme-main'>Вопросы фундаментальной дерматовенерологии</p>" +
                "<p class='speaker'>Председатель: <span>Доля О.В.</span>, заместитель директора по научной работе ГБУЗ «Московский научно-практический центр дерматовенерологии и косметологии» Департамента здравоохранения г. Москвы, профессор кафедры дерматовенерологии и аллергологии с курсом иммунологии Медицинского института ФГАПОУ ВО «Российский университет дружбы народов», заместитель главного редактора журнала «Клиническая дерматология и венерология», д.м.н., к.филос.н., профессор.</p>" +
                "<p class='theme'>Нарушения иннервации и патология кожи – путь к пониманию механизмов развития и эффективной терапии дерматозов</p>"+
                "<p class='speaker'>Петрова Г.А., Петрова К.С. (15 мин.)</p>"+
                "<p class='theme'>Алгоритм ведения пациентов с сухостью кожи при использовании современных генетических и инструментальных методов</p>"+
                "<p class='speaker'>Макеенко О.А., Еремина А.А., Сергеева И.Г. (15 мин.)</p>"+
                "<p class='theme'>Современное понимание проблемы хронического гнойного гидраденита</p>"+
                "<p class='speaker'>Бурова С. А., руководитель Московского центра глубоких микозов, вице-президент по медицинской микологии Национальной академии микологии, заведующая отделением оппортунистических микозов Института аллергологии и клинической иммунологии, д.м.н., профессор, академик Российской академии медико-технических наук (15 мин.)</p>"+
                "<p class='speaker'>* При поддержке компании Новартис. Не обеспечивается баллами НМО.</p>"+
                "<p class='theme'>Проблемы комплаентности в лечении атопического дерматита</p>"+
                "<p class='speaker'>Матушевская Е.В. (15 мин.)</p>"+
                "<p class='speaker'>* При поддержке компании Байер. Не обеспечивается баллами НМО.</p>"+
                "<p class='theme'>Сравнительный анализ ультраструктурных нарушений процессов кератинизации у взрослых и детей с болезнью Девержи</p>"+
                "<p class='speaker'>Заварина И.В. (10 мин.)</p>"+
                "<p class='theme'>Особенности гипокомплементемического уртикарного васкулита в практике ревматолога</p>"+
                "<p class='speaker'>Егорова О.Н. (10 мин.)</p>"+
                "<p class='theme'>К вопросу определения тяжести пруриго</p>"+
                "<p class='speaker'>Потекаев Н.Н.; Бобко С.И., старший научный сотрудник отдела клинической дерматовенерологии и косметологии Московского научно-практического центра дерматовенерологии и косметологии, к.м.н.; Штендер С. (10 мин.)</p>"+
                "<p class='theme'>Дискуссия (5 мин.)</p>"
            ,
            id: 31,
          },
          {
            current: "Сейчас",
            time: "14:00–15:45",
            timeStart: {
              year: 2023,
              month: 2,
              date: 14,
              hours: 14,
              minute: 0,
            },
            timeEnd: {
              year: 2023,
              month: 2,
              date: 14,
              hours: 15,
              minute: 45,
            },
            support: "",
            title: "Ежегодная конференция\n" +
                "дерматовенерологов и\n" +
                "дерматоонкологов: актуальные\n" +
                "вопросы дерматоонкологии\n" +
                "и профилактики\n" +
                "новообразований. Часть 1",
            speaker: "Сопредседатели: Титов К.С.,\n" +
                "Поляков А. П., Новожилова О. Л.,\n" +
                "Кудрявцев Д.В.",
            textHtml: "<div class='popup__top'> " +
                "<p class='item__time item__time-popup'>14:00–15:45</p>" +
                "<p class='text-gray'></p>" +
                "</div>" +
                "<p class='support'></p>" +
                "<p class='theme-main'>Ежегодная конференция дерматовенерологов и дерматоонкологов: актуальные вопросы дерматоонкологии и профилактики новообразований. Часть 1.</p>" +
                "<p class='speaker'>Сопредседатели:</p>" +
                "<p class='speaker'><span>Титов К.С.</span>, профессор кафедры онкологии и рентгенорадиологии им. В.П. Харченко Медицинского института ФГАОУ ВО «Российский университет дружбы народов», ведущий научный сотрудник ГБУЗ ГКБ им. С.П. Боткина Департамента здравоохранения города Москвы, президент АНО «Национальный Альянс специалистов по опухолям наружных локализаций», доктор медицинских наук.</p>" +
                "<p class='speaker'><span>Поляков А. П.</span>, профессор кафедры онкологии, радиотерапии и реконструктивной хирургии ФГАОУ ВО «Первый Московский государственный медицинский университет им. И. М. Сеченова» Минздрава России, заведующий отделением микрохирургии Московского научно-исследовательского онкологического института им. П.А. Герцена – филиал ФГБУ «НМИЦ радиологии» Минздрава России, д.м.н.</p>" +
                "<p class='speaker'><span>Новожилова О. Л.</span>, заместитель главного врача по организационно-методической работе ГБУЗ «Московский научно-практический центр дерматовенерологии и косметологии» Департамента здравоохранения г. Москвы.</p>" +
                "<p class='speaker'><span>Кудрявцев Д.В.</span>, заведующий онкологическим отделением № 5   ЦАО ГБУЗ «Городская клиническая онкологическая больница № 1» Департамента здравоохранения г. Москвы, д.м.н.</p>" +
                "<p class='theme'>Современные стандарты лечения меланомы кожи</p>" +
                "<p class='speaker'>Титов К.С. (20 мин.)</p>" +
                "<p class='theme'>Клинико-дерматоскопическая вариабельность беспигментной и гипопигментной меланомы кожи</p>" +
                "<p class='speaker'>Раводин Р. А., профессор кафедры дерматовенерологии «Центральной государственной медицинской академии» Управления делами Президента Российской Федерации, заведующий онкологическим отделением № 3 Центра амбулаторной онкологической помощи ЦАО ГБУЗ «Городская клиническая онкологическая больница № 1» Департамента здравоохранения г. Москвы, д.м.н. (15 мин.)</p>" +
                "<p class='theme'>Роль биопсии сторожевого лимфатического узла в определении прогноза и тактики лечения клинически локализованной меланомы кожи</p>" +
                "<p class='speaker'>Кудрявцев Д.В. (15 мин.)</p>" +
                "<p class='theme'>Нужна ли регионарная лимфаденэктомия пациентам с метастазом меланомы в сторожевой лимфатический узел?</p>" +
                "<p class='speaker'>Абрамова О.Э., врач-радиолог отделения комбинированного лечения опухолей костей, мягких тканей и кожи Медицинского радиологического научного центра им. А.Ф. Цыба – филиал ФГБУ «Национальный медицинский исследовательский центр радиологии» Минздрава России (15 мин.)</p>" +
                "<p class='theme'>Гемобластозы с поражением кожи</p>" +
                "<p class='speaker'>Дудина Г.А., заведующая отделением гематологии и химиотерапии гемобластозов ГБУЗ «Московский клинический научно-практический центр им. А.С. Логинова» Департамента здравоохранения г. Москвы, д.м.н. (15 мин.)</p>" +
                "<p class='theme'>Персонифицированные исследования, ориентированные на профилактику и высокотехнологичное лечение онкологических заболеваний кожи на ранних стадиях</p>" +
                "<p class='speaker'>Кочетков М.А., ведущий научный сотрудник отдела клинической дерматовенерологии и косметологии отдела оказания специализированной медицинской помощи ГБУЗ «Московский научно-практический центр дерматовенерологии и косметологии» Департамента здравоохранения г. Москвы, к.м.н.  (15 мин.)</p>" +
                "<p class='theme'>Дискуссия (10 мин.)</p>"
            ,
            id: 32,
          },
          {
            current: "Сейчас",
            time: "16:00–17:30",
            timeStart: {
              year: 2023,
              month: 2,
              date: 14,
              hours: 16,
              minute: 0,
            },
            timeEnd: {
              year: 2023,
              month: 2,
              date: 14,
              hours: 17,
              minute: 30,
            },
            support: "",
            title: "Ежегодная конференция\n" +
                "дерматовенерологов и\n" +
                "дерматоонкологов: актуальные\n" +
                "вопросы дерматоонкологии и\n" +
                "профилактики ново образований.\n" +
                "Часть 2.",
            speaker: "Сопредседатели: Титов К.С.,\n" +
                "Поляков А.П., Новожилова О.Л.,\n" +
                "Кудрявцев Д.В.",
            textHtml: "<div class='popup__top'> " +
                "<p class='item__time item__time-popup'>16:00–17:30</p>" +
                "<p class='text-gray'></p>" +
                "</div>" +
                "<p class='support'></p>" +
                "<p class='theme-main'>Ежегодная конференция дерматовенерологов и дерматоонкологов: актуальные вопросы дерматоонкологии и профилактики новообразований.  Часть 2.</p>" +
                "<p class='speaker'>Сопредседатели: <span>Титов К.С., </span><span>Поляков А.П., </span><span>Новожилова О.Л., </span><span>Кудрявцев Д.В.</span></p>" +
                "<p class='theme'>Реконструктивно-пластические операции при лечении опухолей кожи головы и шеи</p>" +
                "<p class='speaker'>Поляков А.П. (15 мин.)</p>" +
                "<p class='theme'>Особенности диагностики и лечения детей с синдромом Горлина-Гольца</p>" +
                "<p class='speaker'>Белышева Т.С., врач-дерматовенеролог, ведущий научный сотрудник научно-консультативного отделения НИИ Детской онкологии и гематологии ФГБУ «Национальный медицинский исследовательский центр онкологии им.Н.Н. Блохина» Министерства здравоохранения Российской Федерации, д.м.н. (15 мин.)</p>" +
                "<p class='theme'>Возможности оригинальной мультиагентной системы для ранней диагностики меланомы кожи</p>" +
                "<p class='speaker'>Неретин Е.Ю., врач-онколог, доцент кафедры хирургии с курсом онкологии Медицинский университет РЕАВИЗ г. Самара, к.м.н.  (15 мин.)</p>" +
                "<p class='theme'>Нехирургические методы лечения рака кожи</p>" +
                "<p class='speaker'>Красноруцкий А.В., и.о. заведующего отделением опухолей кожи и мягких тканей ГБУЗ «Московский клинический научно-практический центр им. А.С. Логинова»  Департамента здравоохранения г. Москвы (15 мин.)</p>" +
                "<p class='theme'>Редкие меланоцитарные невусы кожи</p>" +
                "<p class='speaker'>Жучков М.В., заместитель главного врача ГБУ РО «Рязанский областной клинический кожно-венерологический диспансер», доцент кафедры ФГБУ ВО «Рязанский государственный медицинский университет им. академика И.П. Павлова» Минздрава России, к.м.н. (15 мин.)</p>" +
                "<p class='theme'>Дискуссия (15 мин.)</p>"
            ,
            id: 33,
          },
        ],
        [
          {
            current: "Сейчас",
            time: "12:15–13:45",
            timeStart: {
              year: 2023,
              month: 2,
              date: 14,
              hours: 12,
              minute: 15,
            },
            timeEnd: {
              year: 2023,
              month: 2,
              date: 14,
              hours: 13,
              minute: 45,
            },
            support: "",
            title: "Междисциплинарный круглый\n" +
                "стол по вирусу папилломы\n" +
                "человека",
            speaker: "Сопредседатели: Потекаев Н.Н.;\n" +
                "Шелыгин Ю.А.",
            textHtml: "<div class='popup__top'> " +
                "<p class='item__time item__time-popup'>12:15–13:45</p>" +
                "<p class='text-gray'></p>" +
                "</div>" +
                "<p class='support'></p>" +
                "<p class='theme-main'>Междисциплинарный круглый стол по вирусу папилломы человека</p>" +
                "<p class='speaker'>Сопредседатели: <span>Потекаев Н.Н.</span>, <span>Шелыгин Ю.А.</span>, главный внештатный специалист колопроктолог Министерства здравоохранения РФ и Департамента здравоохранения г. Москвы, директор ФГБУ «Национальный медицинский исследовательский центр колопроктологии им. А.Н. Рыжих» Министерства здравоохранения РФ, д.м.н., профессор, академик РАН;</p>" +
                "<p class='theme'>Современная стратегия профилактики ВПЧ-ассоциированных заболеваний</p>" +
                "<p class='speaker'>Уварова Е.В. (20 мин.)</p>"+
                "<p class='theme'>ВПЧ как ИППП. Преимущества гендерно-нейтральной вакцинации от ВПЧ</p>" +
                "<p class='speaker'>Гомберг М.А. (20 мин.)</p>"+
                "<p class='theme'>Распространенность вируса папилломы человека различного канцерогенного риска среди пациентов дерматовенерологического профиля</p>" +
                "<p class='speaker'>Кулешова О.Б., Надысева Т.В., Юнакова И.В., Домонова Э.А. (20 мин.)</p>"+
                "<p class='theme'>ВПЧ-ассоциированные заболевания вульвы и влагалища</p>" +
                "<p class='speaker'>Аполихина И.А., заведующая отделением Эстетической гинекологии и реабилитации ФГБУ «Национальный медицинский исследовательский центр акушерства, гинекологии и перинатологии им. В.И. Кулакова» Минздрава России, профессор кафедры акушерства, гинекологии, перинатологии и репродуктологии ИПО ФГАОУ ВО Первый МГМУ им. И.М. Сеченова Минздрава России, профессор кафедры акушерства и гинекологии департамента профессионального образования ФГБУ «НМИЦ АГП им. В.И. Кулакова» Минздрава России, д.м.н., профессор;\n" +
                "Горбунова Е.А. (20 мин.)\n</p>"+
                "<p class='theme'>Дискуссия (10 мин.)</p>"
            ,
            id: 41,
          },
          {
            current: "Сейчас",
            time: "14:00–15:30",
            timeStart: {
              year: 2023,
              month: 2,
              date: 14,
              hours: 14,
              minute: 0,
            },
            timeEnd: {
              year: 2023,
              month: 2,
              date: 14,
              hours: 15,
              minute: 30,
            },
            support: "",
            title: "Заседание Профильной комиссии\n" +
                "Министерства здравоохранения\n" +
                "Российской Федерации\n" +
                "по дерматовенерологии и\n" +
                "косметологии",
            speaker: "Председатель: Потекаев Н.Н.",
            textHtml: "<div class='popup__top'> " +
                "<p class='item__time item__time-popup'>14:00–15:30</p>" +
                "<p class='text-gray'></p>" +
                "</div>" +
                "<p class='support'></p>" +
                "<p class='theme-main'>Заседание Профильной комиссии Министерства здравоохранения Российской Федерации по дерматовенерологии и косметологии</p>" +
                "<p class='speaker'>Председатель: <span>Потекаев Н.Н.</span></p>"
            ,
            id: 42,
          },
          {
            current: "Сейчас",
            time: "15:45-17:30",
            timeStart: {
              year: 2023,
              month: 2,
              date: 14,
              hours: 15,
              minute: 45,
            },
            timeEnd: {
              year: 2023,
              month: 2,
              date: 14,
              hours: 17,
              minute: 30,
            },
            support: "",
            title: "Роль ИППП в патологии\n" +
                "репродуктивного здоровья",
            speaker: "Председатель: Гамидов С.И.\n" +
                "Сопредседатели: Чернова Н.И.,\n" +
                "Кузнецова И.В., Божедомов В.А.,\n" +
                "Кузьмин В.Н",
            textHtml: "<div class='popup__top'> " +
                "<p class='item__time item__time-popup'>15:45-17:30</p>" +
                "<p class='text-gray'></p>" +
                "</div>" +
                "<p class='support'></p>" +
                "<p class='theme-main'>Роль ИППП в патологии репродуктивного здоровья</p>" +
                "<p class='speaker'>Председатель: <span>Гамидов С.И.</span>,</p>" +
                "<p class='speaker'>Сопредседатели: <span>Чернова Н.И.</span>, <span>Кузнецова И.В.</span>, <span>Божедомов В.А.</span>, <span>Кузьмин В.Н.</span></p>" +
                "<p class='theme'>Андрологические проблемы при инфекционно-воспалительном процессе половых органов</p>" +
                "<p class='speaker'>Гамидов С.И., заведующий отделением Андрологии и урологии Национального исследовательского центра акушерства, гинекологии и перинатологии им. В.И. Кулакова МЗ РФ, д.м.н., профессор кафедры АГПиР ФПО ПМГМУ им. ИМ Сеченова (20 мин.)</p>"+
                "<p class='theme'>Роль инфекционно-воспалительных факторов в патогенезе мужского бесплодия: что нового?</p>" +
                "<p class='speaker'>Божедомов В.А., заведующий «Клиникой мужского здоровья» МНОЦ и профессор кафедры урологии и андрологии ФФМ МГУ им. М.В. Ломоносова, ведущий научный сотрудник Национального исследовательского центра акушерства, гинекологии и перинатологии им. В.И. Кулакова МЗ РФ, уролог-андролог поликлиники № 3 УДП РФ, д.м.н., профессор (20 мин.)</p>"+
                "<p class='theme'>Наиболее значимые инфекции в нарушении репродуктивного здоровья женщины. Современное состояние проблемы. </p>" +
                "<p class='speaker'>Кузьмин В.Н., руководитель Центра перинатальных инфекций, профессор кафедры репродуктивной медицины и хирургии ФПДО МГМСУ, президент Европейского общества по инфекционным заболеваниям в акушерстве и гинекологии в России, д.м.н., профессор (20 мин.)</p>"+
                "<p class='theme'>Тихая эпидемия. Хронический эндометрит и бесплодие. Кто виноват и что делать. </p>" +
                "<p class='speaker'>Кузнецова И.В., президент Международной ассоциации гинекологов, эндокринологов и терапевтов, заместитель генерального директора по научно-исследовательской работе медицинского комплекса Витбиомед, д.м.н., профессор (15 мин.)</p>"+
                "<p class='theme'>Роль дерматовенеролога при ведении пар с нарушением фертильности. Разбор клинических случаев. </p>" +
                "<p class='speaker'>Чернова Н.И., руководитель научного отдела аногенитальных дерматозов и инфекций, передаваемых преимущественно половым путем, д.м.н. (15 мин.)</p>"+
                "<p class='theme'>Дискуссия (15 мин.)</p>"
            ,
            id: 43,
          },
        ],
        [
          {
            current: "Сейчас",
            time: "12:15–13:45",
            timeStart: {
              year: 2023,
              month: 2,
              date: 14,
              hours: 12,
              minute: 15,
            },
            timeEnd: {
              year: 2023,
              month: 2,
              date: 14,
              hours: 13,
              minute: 45,
            },
            support: "Сателлитный симпозиум Джонсон\n" +
                "и Джонсон\n" +
                "* Не обеспечивается баллами НМО ",
            title: "Эволюция биологической\n" +
                "терапии псориаза: будущее уже\n" +
                "сегодня",
            speaker: "Председатель: Разнатовский К. И.",
            textHtml: "<div class='popup__top'> " +
                "<p class='item__time item__time-popup'>12:15–13:45</p>" +
                "<p class='text-gray'>* Не обеспечивается баллами НМО </p>" +
                "</div>" +
                "<p class='support'>Сателлитный симпозиум Джонсон и Джонсон</p>" +
                "<p class='theme-main'>Эволюция биологической терапии псориаза: будущее уже сегодня </p>" +
                "<p class='speaker'>Председатель: <span>Разнатовский К.И.</span></p>" +
                "<p class='theme'>Неудовлетворенные потребности и новые перспективы в терапии псориаза</p>" +
                "<p class='speaker'>Разнатовский К.И. (25 мин.)</p>"+
                "<p class='theme'>Персонализированный подход в лечении псориаза</p>" +
                "<p class='speaker'>Хлебникова А.Н. (25 мин.)</p>"+
                "<p class='theme'>Высокое качество жизни пациента как цель терапии псориаза</p>" +
                "<p class='speaker'>Артемьева С.И. (25 мин.)</p>"+
                "<p class='theme'>Дискуссия (15 мин.)</p>"
            ,
            id: 51,
          },
          {
            current: "Сейчас",
            time: "14:00–15:30",
            timeStart: {
              year: 2023,
              month: 2,
              date: 14,
              hours: 14,
              minute: 0,
            },
            timeEnd: {
              year: 2023,
              month: 2,
              date: 14,
              hours: 15,
              minute: 30,
            },
            support: "",
            title: "Современные аспекты\n" +
                "диагностики и терапии\n" +
                "распространенных дерматозов.\n" +
                "Часть 2",
            speaker: "Председатель: Петунина В.В.",
            textHtml: "<div class='popup__top'> " +
                "<p class='item__time item__time-popup'>14:00–15:30</p>" +
                "<p class='text-gray'></p>" +
                "</div>" +
                "<p class='support'></p>" +
                "<p class='theme-main'>Современные аспекты диагностики и терапии распространенных дерматозов. Часть 2.</p>" +
                "<p class='speaker'>Председатель: <span>Петунина В.В.</span></p>" +
                "<p class='theme'>Современная концепция патогенеза атопического дерматита</p>" +
                "<p class='speaker'>Петрова С.Ю. (15 мин.) </p>" +
                "<p class='speaker'>* При поддержке компании Ретиноиды. Не обеспечивается баллами НМО.</p>" +
                "<p class='theme'>Дерматозы лица: особенности диагностики, лечения и профилактики</p>" +
                "<p class='speaker'>Проценко Т.В., Проценко О.А., Милус И.Е. (15 мин.)</p>" +
                "<p class='theme'>Клинические аспекты фотоповреждения кожи</p>" +
                "<p class='speaker'>Сергеева И.Г. (15 мин.)</p>" +
                "<p class='theme'>Инновационный подход к оптимизации процессов регенерации повреждений кожи: эксперимент и клинические перспективы</p>" +
                "<p class='speaker'>Кунгуров Н.В., Гольцов С.В. (15 мин.)</p>" +
                "<p class='theme'>Патологические состояния придатков кожи, индуцированные химиотерапией</p>" +
                "<p class='speaker'>Смагина Е.А., дерматовенеролог, косметолог,  ассистент кафедры ФГБОУ ВО РязГМУ Минздрава России, ведущий специалист сети клиник «Ниармедик», Рязань (15 мин.)</p>" +
                "<p class='theme'>Дискуссия (15 мин.)</p>"
            ,
            id: 52,
          },
          {
            current: "Сейчас",
            time: "15:45–16:45",
            timeStart: {
              year: 2023,
              month: 2,
              date: 14,
              hours: 15,
              minute: 45,
            },
            timeEnd: {
              year: 2023,
              month: 2,
              date: 14,
              hours: 16,
              minute: 45,
            },
            support: "Сателлитный симпозиум компании\n" +
                "Санофи\n" +
                "* Не обеспечивается баллами НМО",
            title: "Атопический дерматит: от фундаментальной науки к реальным\n" +
                "решениям для пациентов ",
            speaker: "Сопредседатели:\n" +
                "Разнатовский К.И., Ильина Н.И.",
            textHtml: "<div class='popup__top'> " +
                "<p class='item__time item__time-popup'>15:45–16:45</p>" +
                "<p class='text-gray'>* Не обеспечивается баллами НМО</p>" +
                "</div>" +
                "<p class='support'>Сателлитный симпозиум компании Санофи</p>" +
                "<p class='theme-main'>Атопический дерматит: от фундаментальной науки к реальным решениям для пациентов </p>" +
                "<p class='speaker'>Сопредседатели: <span>Разнатовский К.И.</span>, <span>Ильина Н.И.</span></p>" +
                "<p class='theme'>Системный подход к системному заболеванию</p>" +
                "<p class='speaker'>Феденко Е.С. (15 мин.)</p>" +
                "<p class='theme'>Возможности помощи пациентам, нуждающимся в системной терапии: опыт Краснодарского края</p>" +
                "<p class='speaker'>Глузмин М.И. (15 мин.)</p>" +
                "<p class='theme'>Опыт организации городского центра ГИБТ на примере Санкт-Петербургского городского кожно-венерологического диспансера</p>" +
                "<p class='speaker'>Максимова М.Д. (15 мин.)</p>" +
                "<p class='theme'>Дискуссия (15 мин.)</p>"
            ,
            id: 53,
          },
          {
            current: "Сейчас",
            time: "17:00–18:30",
            timeStart: {
              year: 2023,
              month: 2,
              date: 14,
              hours: 17,
              minute: 0,
            },
            timeEnd: {
              year: 2023,
              month: 2,
              date: 14,
              hours: 18,
              minute: 30,
            },
            support: "Сателлитный симпозиум при поддержке\n" +
                "компании Новартис\n" +
                "* Не обеспечивается баллами НМО",
            title: "Системный подход к контролю\n" +
                "Псориатической болезни.\n" +
                "Организация помощи и выбор\n" +
                "терапии.",
            speaker: "Председатель: Разнатовский К.И.",
            textHtml: "<div class='popup__top'> " +
                "<p class='item__time item__time-popup'>17:00–18:30</p>" +
                "<p class='text-gray'>* Не обеспечивается баллами НМО</p>" +
                "</div>" +
                "<p class='support'>Сателлитный симпозиум при поддержке компании Новартис</p>" +
                "<p class='theme-main'>Системный подход к контролю Псориатической болезни. Организация помощи и выбор терапии.</p>" +
                "<p class='speaker'>Председатель: <span>Разнатовский К.И.</span></p>" +
                "<p class='theme'>Актуальность Псориатической болезни в РФ, нагрузка на систему здравоохранения. Изменения в системе обеспечения пациентов ГИБП в 2023 г.</p>" +
                "<p class='speaker'>Разнатовский К.И. (25 мин.)</p>"+
                "<p class='theme'>Выбор терапии при Псориатической болезни. Выбор ГИБП: универсальный или для каждого пациента свой? Разбор клинических ситуаций.</p>" +
                "<p class='speaker'>Кохан М.М. (30 мин.)</p>"+
                "<p class='theme'>Терапия Псориатической болезни у детей: современные подходы в реальной клинической практике</p>" +
                "<p class='speaker'>Дениева М.И. (25 мин.)</p>"+
                "<p class='theme'>Дискуссия (10 мин.)</p>"
            ,
            id: 54,
          },
        ]
      ],
      timer: null,
      currentAction: [],
    }
  },
  components: {
    March14Preview, VPopup,
  },
  mounted() {
    this.$store.commit('clearTimer')
    // console.log(this.$store.state.timer)

    this.$store.commit('setTimer', setInterval(() => {
      this.checkDate();
      // console.log("TEST")
    }, 1000))
  },
  destroyed() {
    // console.log('clear');
  },
  beforeDestroy() {
    // console.log('clear');
    this.$store.commit('clearTimer')

  },
  computed: {
    showActiveClass() {
      return item => {
        return !!this.currentAction.find((date) => date.id == item.id);
      }
    }
  },
  methods: {
    showPopup(item) {
      this.popupVisible = true;
      this.currentPopup = item
    },
    closePopup() {
      this.popupVisible = false;
    },
    checkDate() {
      this.currentAction = [];
      this.row.forEach(column => {
        column.forEach(item => {
          if (this.checkTimeAndDate(item)) {
            this.currentAction.push(item);
          }
        })
      })
    },
    checkTimeAndDate(item) {
      const date = new Date().getTime();
      const dateStart = new Date(item.timeStart.year, item.timeStart.month, item.timeStart.date, item.timeStart.hours, item.timeStart.minute).getTime();
      const dateEnd = new Date(item.timeEnd.year, item.timeEnd.month, item.timeEnd.date, item.timeEnd.hours, item.timeEnd.minute).getTime();

      return date >= dateStart && date <= dateEnd;
    },
  },
}
</script>

<style lang="scss">

.popup__top {
  display: flex;
  align-items: baseline;
  gap: 48px;
  justify-content: flex-start;
}

.text-gray {
  font-family: 'Noto-regular', sans-serif;
  font-size: 40px;
  line-height: 54px;
  letter-spacing: 0.02em;
  text-transform: uppercase;
  color: #909090;
}

.support {
  font-family: 'Noto-regular', sans-serif;
  font-size: 50px;
  line-height: 68px;
  letter-spacing: 0.02em;
  text-transform: uppercase;
  color: #606060;
  margin-bottom: 48px;
}

.theme-main {
  font-family: 'Noto-semibold', sans-serif;
  font-size: 60px;
  line-height: 82px;
  text-transform: uppercase;
  color: #303030;
  margin-bottom: 48px;
}

.speaker {
  font-family: 'Noto-regular', sans-serif;
  font-size: 40px;
  line-height: 54px;
  letter-spacing: 0.02em;
  color: #909090;
  margin-bottom: 48px;
  span{
    color: #303030;
  }
}

.theme {
  font-family: 'Noto-semibold', sans-serif;
  font-size: 40px;
  line-height: 54px;
  letter-spacing: 0.02em;
  color: #606060;
  margin-bottom: 24px;
}

.fade-enter-active,
.fade-leave-active {
  transition: opacity 0.5s ease;
}

.fade-enter-from,
.fade-leave-to {
  opacity: 0;
}

.row {
  display: flex;
  align-items: flex-start;
  justify-content: space-around;
  padding: 46px 0;

  .column {
    width: 684.96px;
    padding: 48px;
    height: 100%;
    border-radius: 48px;

    .item {
      text-align: left;
      border-radius: 48px;
      margin-bottom: 50px;
      padding: 48px;
      color: #FFFFFF;
      text-transform: capitalize;

      &__support {
        font-family: 'Noto-light', sans-serif;
        font-size: 38px;
        line-height: 65px;
        letter-spacing: 0.02em;
        margin-bottom: 48px;
        color: #D9D9D9;
      }

      &__title {
        font-family: 'Noto-bold', sans-serif;
        font-size: 48px;
        line-height: 65px;
        letter-spacing: 0.02em;
        margin-bottom: 48px;
        word-wrap: break-word;
      }

      &__speaker {
        font-family: 'Noto-light', sans-serif;
        font-size: 38px;
        line-height: 65px;
        letter-spacing: 0.02em;
        margin-bottom: 48px;
        color: #D9D9D9;
      }

      &__more-info {
        padding: 24px 32px;
        border-radius: 24px;
        font-family: 'Noto-bold', sans-serif;
        font-size: 48px;
        line-height: 65px;
        text-align: center;
        letter-spacing: 0.02em;
        cursor: pointer;
        background: rgba(213, 139, 170, 0.2);
      }

      &__current {
        display: none;
      }
    }

    .item-active {
      background: #B6466C;

      .item__current {
        display: block;
        font-family: 'Noto-regular', sans-serif;
        font-size: 36px;
        line-height: 49px;
        letter-spacing: 0.02em;
        margin-bottom: 48px;
      }

      .item__more-info {
        background: #D58BAA;
      }

      .item__speaker {
        color: #FFFFFF;
      }

      .item__support {
        color: #FFFFFF;
      }
    }

  }
}

.item__time {
  padding: 8px 32px;
  background: rgba(255, 255, 255, 0.1);
  border-radius: 24px;
  font-family: 'Noto-semibold', sans-serif;
  font-size: 64px;
  line-height: 87px;
  display: inline-block;
  margin-bottom: 48px;
}

.item__time-popup {
  background: #D58BAA;
  color: #FFFFFF;
}
</style>
